Функция ЗаписьТолькоНаСервере() Экспорт
	Возврат Истина;	
КонецФункции

//Функция ЗапретДублейУЛога() Экспорт
//	Возврат Истина;
//КонецФункции

//Функция Имя() Экспорт
//	Возврат "МоеИмя";
//КонецФункции

Функция НовыйПараметрыСпособаЛогирования() Экспорт
	ПараметрыСпособа = Новый Структура;
	ПараметрыСпособа.Вставить("Префикс","");
	Возврат ПараметрыСпособа;	
КонецФункции

Процедура ЗаписатьСообщениеВЛог(Сообщение, Лог, УровеньЛогирования, Параметры) Экспорт
	СообщениеДляЗаписи = Параметры.Префикс  + Сообщение;
	лЛогСлужебныйСервер.ЗаписатьСообщениеЛогаВБазу(Лог, СообщениеДляЗаписи, УровеньЛогирования);
КонецПроцедуры