//Функция ЗаписьТолькоНаСервере() Экспорт
//	Возврат Ложь;	
//КонецФункции

//Функция ЗапретДублейУЛога() Экспорт
//	Возврат Истина;
//КонецФункции

//Функция Имя() Экспорт
//	Возврат "МоеИмя";
//КонецФункции

Функция НовыйПараметрыСпособаЛогирования() Экспорт
	ПараметрыСпособа = Новый Структура;
	ПараметрыСпособа.Вставить("Префикс","");
	Возврат ПараметрыСпособа;	
КонецФункции

Процедура ЗаписатьСообщениеВЛог(Сообщение, Лог, УровеньЛогирования, Параметры) Экспорт
	#Если Клиент Тогда
	ПоказатьОповещениеПользователя(Параметры.Префикс +"/" +Сообщение);
	#КонецЕсли
КонецПроцедуры