
// @unit-test
// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
Процедура ПроверитьУстановитьИмяСобытияЛогирования(Фреймворк) Экспорт
	
	ЭталонноеЗначение = "Тест";
	
	лЛог.УстановитьИмяСобытияЛогирования(ЭталонноеЗначение);
	ПараметрыЛогирования = лЛог.ПараметрыЛогирования();
	
	Фреймворк.ПроверитьРавенство(ЭталонноеЗначение, ПараметрыЛогирования.ИмяСобытия);
	
	лЛог.ЗавершитьЛогирование();
	
КонецПроцедуры

// @unit-test
// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
Процедура ПроверитьУстановитьУровеньЛогирования(Фреймворк) Экспорт
	
	ЭталонноеЗначение = ПредопределенноеЗначение("Перечисление.лУровниЛогирования.ПРЕДУПРЕЖДЕНИЕ");
	
	лЛог.УстановитьУровеньЛогирования(ЭталонноеЗначение);
	ПараметрыЛогирования = лЛог.ПараметрыЛогирования();
	
	Фреймворк.ПроверитьРавенство(ЭталонноеЗначение, ПараметрыЛогирования.УровеньЛогирования);
	
	лЛог.ЗавершитьЛогирование();
	
КонецПроцедуры

// @unit-test
// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
Процедура ПроверитьДобавитьСпособЛогирования(Фреймворк) Экспорт
	
	ЭталонноеЗначение = ПредопределенноеЗначение("Перечисление.лСпособыЛогирования.Память");
	
	лЛог.ДобавитьСпособЛогирования(ЭталонноеЗначение);
	ПараметрыЛогирования = лЛог.ПараметрыЛогирования();
	
	ПроверяемоеЗначение = ПараметрыЛогирования.СпособыЛогирования.Получить(ЭталонноеЗначение) <> Неопределено;
	
	Фреймворк.ПроверитьИстину(ПроверяемоеЗначение);
	
	лЛог.ЗавершитьЛогирование();
	
КонецПроцедуры

// @unit-test
// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
Процедура ПроверитьУстановитьПутьКФайлуЛогирования(Фреймворк) Экспорт
	
	ЭталонноеЗначение = "D:\!Temp\Файл лога на сервере.txt";
	
	лЛог.УстановитьПутьКФайлуЛогирования(ЭталонноеЗначение);
	ПараметрыЛогирования = лЛог.ПараметрыЛогирования();
	
	Фреймворк.ПроверитьРавенство(ЭталонноеЗначение, ПараметрыЛогирования.ИмяФайлаЛогаНаСервере);
	
	лЛог.ЗавершитьЛогирование();
	
КонецПроцедуры

// @unit-test
// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
Процедура ПроверитьОтключитьЛогирование(Фреймворк) Экспорт
	
	лЛог.ОтключитьЛогирование();
	ПараметрыЛогирования = лЛог.ПараметрыЛогирования();
	
	Фреймворк.ПроверитьИстину(ПараметрыЛогирования.Отключен);
	
	лЛог.ЗавершитьЛогирование();
	
КонецПроцедуры

// @unit-test
// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
Процедура ПроверитьВключитьЛогирование(Фреймворк) Экспорт
	
	лЛог.ОтключитьЛогирование();
	ПараметрыЛогирования = лЛог.ПараметрыЛогирования();
	
	Фреймворк.ПроверитьИстину(ПараметрыЛогирования.Отключен);
		
	лЛог.ВключитьЛогирование();
	ПараметрыЛогирования = лЛог.ПараметрыЛогирования();
	
	Фреймворк.ПроверитьЛожь(ПараметрыЛогирования.Отключен);
	
	лЛог.ЗавершитьЛогирование();
	
КонецПроцедуры