
///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Automation
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Automation.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,ОписаниеШага,ТипШага,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯДобавляюВЛогПоУмолчаниюСпособЛогированияЖурналРегистрации()","ЯДобавляюВЛогПоУмолчаниюСпособЛогированияЖурналРегистрации","И я добавляю в лог по умолчанию способ логирования ЖурналРегистрации","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"КоличествоСообщенийВЖурналеРегистрацииРавно(Парам01)","КоличествоСообщенийВЖурналеРегистрацииРавно","И количество сообщений в журнале регистрации равно 0","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯДобавляюВЛогСИменемСпособЛогированияЖурналРегистрации(Парам01)","ЯДобавляюВЛогСИменемСпособЛогированияЖурналРегистрации","И я добавляю в лог с именем ""ЛогироватьНеУмею"" способ логирования ЖурналРегистрации","","");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Функция выполняется перед началом каждого сценария
Функция ПередНачаломСценария() Экспорт
	Контекст.Вставить("ДатаНачалаСценария", ТекущаяДата());
КонецФункции

&НаКлиенте
// Функция выполняется перед окончанием каждого сценария
Функция ПередОкончаниемСценария() Экспорт
	
КонецФункции


///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//И я добавляю в лог по умолчанию способ логирования ЖурналРегистрации
//@ЯДобавляюВЛогПоУмолчаниюСпособЛогированияЖурналРегистрации()
Функция ЯДобавляюВЛогПоУмолчаниюСпособЛогированияЖурналРегистрации() Экспорт
	лЛог.ДобавитьСпособЛогированияЖурналРегистрации();	
КонецФункции

&НаКлиенте
//И количество сообщений в журнале регистрации равно 0
//@КоличествоСообщенийВЖурналеРегистрацииРавно(Парам01)
Функция КоличествоСообщенийВЖурналеРегистрацииРавно(ОжидаемоеКоличество) Экспорт
	Количество = КоличествоСообщенийВЖурналеРегистрации(Контекст.ДатаНачалаСценария);
	Ванесса.ПроверитьРавенство(Количество, ОжидаемоеКоличество);
КонецФункции

&НаСервере
Функция КоличествоСообщенийВЖурналеРегистрации(ДатаНачала)
	ТаблицаЖурнала = Новый ТаблицаЗначений;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ДатаНачала",ДатаНачала);
	//
	//Логи = лЛог.
	//
	//Отбор.Вставить("Событие", "Логирование");
	
	ВыгрузитьЖурналРегистрации(ТаблицаЖурнала,Отбор);
	
	Количество = 0;
	
	Для Каждого Стр Из ТаблицаЖурнала Цикл
		Если СтрНачинаетсяС(Стр.Событие, "Логирование") Тогда 
			Количество = Количество +1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Количество;
КонецФункции

&НаКлиенте
//И я добавляю в лог с именем "ЛогироватьНеУмею" способ логирования ЖурналРегистрации
//@ЯДобавляюВЛогСИменемСпособЛогированияЖурналРегистрации(Парам01)
Функция ЯДобавляюВЛогСИменемСпособЛогированияЖурналРегистрации(ИмяЛога) Экспорт
	лЛог.ДобавитьСпособЛогированияЖурналРегистрации(ИмяЛога);	
КонецФункции
