#Область ПрограммныйИнтерфейс

#Область ВыводЛогов

#Область КраткиеВариантыЗаписи

Процедура Отл_(Сообщение, ЛогИлиИмяЛога = Неопределено) Экспорт
	Отладка_(Сообщение, ЛогИлиИмяЛога);
КонецПроцедуры

Процедура Пред_(Сообщение, ЛогИлиИмяЛога = Неопределено) Экспорт
	Предупреждение_(Сообщение, ЛогИлиИмяЛога);
КонецПроцедуры

Процедура Инф_(Сообщение, ЛогИлиИмяЛога = Неопределено) Экспорт
	Информация_(Сообщение, ЛогИлиИмяЛога);
КонецПроцедуры

Процедура Ош_(Сообщение, ЛогИлиИмяЛога = Неопределено) Экспорт
	Ошибка_(Сообщение, ЛогИлиИмяЛога);
КонецПроцедуры

Процедура Крит_(Сообщение, ЛогИлиИмяЛога = Неопределено) Экспорт
	КритическаяОшибка_(Сообщение, ЛогИлиИмяЛога);
КонецПроцедуры

#КонецОбласти

#Область ДлинныеВариантыЗаписи
Процедура Отладка_(Сообщение, ЛогИлиИмяЛога = Неопределено) Экспорт
	лЛогСлужебный.ЗаписатьНовоеСообщениеВЛог(Сообщение, лЛогСлужебный.УровниЛогирования().Отладка, ЛогИлиИмяЛога);
КонецПроцедуры

Процедура Информация_(Сообщение, ЛогИлиИмяЛога = Неопределено) Экспорт
	лЛогСлужебный.ЗаписатьНовоеСообщениеВЛог(Сообщение, лЛогСлужебный.УровниЛогирования().Информация, ЛогИлиИмяЛога);
КонецПроцедуры

Процедура Предупреждение_(Сообщение, ЛогИлиИмяЛога = Неопределено) Экспорт
	лЛогСлужебный.ЗаписатьНовоеСообщениеВЛог(Сообщение, лЛогСлужебный.УровниЛогирования().Предупреждение, ЛогИлиИмяЛога);
КонецПроцедуры

Процедура Ошибка_(Сообщение, ЛогИлиИмяЛога = Неопределено) Экспорт
	лЛогСлужебный.ЗаписатьНовоеСообщениеВЛог(Сообщение, лЛогСлужебный.УровниЛогирования().Ошибка, ЛогИлиИмяЛога);
КонецПроцедуры

Процедура КритическаяОшибка_(Сообщение, ЛогИлиИмяЛога = Неопределено) Экспорт
	лЛогСлужебный.ЗаписатьНовоеСообщениеВЛог(Сообщение, лЛогСлужебный.УровниЛогирования().КритическаяОшибка, ЛогИлиИмяЛога);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ИнициализацияИНастройки

Функция НовыйЛог(ИмяЛога = "", Уровень = "") Экспорт
	Возврат лЛогСлужебный.НовыйЛог(ИмяЛога, Уровень);
КонецФункции

Процедура Отключить(ЛогИлиИмяЛога = Неопределено) Экспорт
	лЛогСлужебный.ОтключитьЛог(ЛогИлиИмяЛога);
КонецПроцедуры

Процедура Включить(ЛогИлиИмяЛога = Неопределено) Экспорт
	лЛогСлужебный.ВключитьЛог(ЛогИлиИмяЛога);
КонецПроцедуры

Процедура ЗавершитьЛогирование(ЛогИлиИмяЛога = Неопределено) Экспорт
	
КонецПроцедуры

Процедура УстановитьУровеньЛогирования(Уровень, ЛогИлиИмяЛога = Неопределено) Экспорт
	лЛогСлужебный.УстановитьУровеньЛогирования(Уровень, ЛогИлиИмяЛога);
КонецПроцедуры

Функция ЛогПоИмени(ИмяЛога = "") Экспорт
	Возврат лЛогСлужебный.ТекущийЛог(ИмяЛога);
КонецФункции

Функция АктивныеЛоги() Экспорт
	Возврат лЛогСлужебный.АктивныеЛоги();
КонецФункции

#Если Клиент Тогда
	
Процедура ОбновитьЛогиНаКлиентеПоДаннымСервера() Экспорт
	лЛогСлужебный.ОбновитьЛогиНаКлиентеПоДаннымСервера();
КонецПроцедуры
#КонецЕсли

#КонецОбласти

Процедура ДобавитьСпособЛогированияКонсоль(ЛогИлиИмяЛога = Неопределено) Экспорт
	ДобавитьСпособЛогирования("Консоль", Неопределено, ЛогИлиИмяЛога);
КонецПроцедуры

Процедура ДобавитьСпособЛогированияБаза(ЛогИлиИмяЛога = Неопределено) экспорт
	ДобавитьСпособЛогирования("База", Неопределено, ЛогИлиИмяЛога);
КонецПроцедуры

Процедура ДобавитьСпособЛогированияЖурналРегистрации(ЛогИлиИмяЛога = Неопределено) экспорт
	ДобавитьСпособЛогирования("ЖурналРегистрации", Неопределено, ЛогИлиИмяЛога);
КонецПроцедуры

Процедура ДобавитьСпособЛогированияПамять(ЛогИлиИмяЛога = Неопределено) экспорт
	ДобавитьСпособЛогирования("Память", Неопределено, ЛогИлиИмяЛога);
КонецПроцедуры

Процедура ДобавитьСпособЛогированияФайл(ИмяФайла, ЛогИлиИмяЛога = Неопределено) Экспорт
	ПараметрыЛогирования = ПараметрыСпособаЛогирования("Файл");
	ПараметрыЛогирования.ИмяФайла = ИмяФайла;
	ДобавитьСпособЛогирования("Файл", ПараметрыЛогирования, ЛогИлиИмяЛога);
КонецПроцедуры

Процедура ДобавитьСпособЛогирования(Способ, Параметры, ЛогИлиИмяЛога = Неопределено) Экспорт
	лЛогСлужебный.ДобавитьСпособЛогирования(Способ, Параметры, ЛогИлиИмяЛога);
КонецПроцедуры

Процедура НастроитьСпособЛогирования(Способ, Параметры, ЛогИлиИмяЛога = Неопределено) Экспорт
	
КонецПроцедуры

Функция ПараметрыСпособаЛогирования(Способ) Экспорт
	Возврат лЛогСлужебный.ПараметрыСпособаЛогирования(Способ);
КонецФункции

Функция ДанныеЛога(ЛогИлиИмяЛога = Неопределено) Экспорт
	Возврат лЛогСлужебный.ДанныеЛога(ЛогИлиИмяЛога);
КонецФункции

Процедура ОчиститьСписокЛогов() Экспорт
	лЛогСлужебный.ОчиститьСписокЛогов();
КонецПроцедуры

#КонецОбласти

