#Область Логирование

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	Если ИменаПараметровСеанса <> Неопределено И ИменаПараметровСеанса.Найти("лПараметрыЛогирования") <> Неопределено Тогда
		лЛогированиеВызовСервераСлужебный.Инициализировать();
	КонецЕсли;
	
	Если ИменаПараметровСеанса <> Неопределено И ИменаПараметровСеанса.Найти("лСообщенияЛогирования") <> Неопределено Тогда
		ПараметрыСеанса.лСообщенияЛогирования = Новый ФиксированныйМассив(Новый Массив);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти