
///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Automation
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Automation.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,ОписаниеШага,ТипШага,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВКонфигурацииЕстьОбщийМодуль(Парам01)","ВКонфигурацииЕстьОбщийМодуль","Когда в конфигурации есть общий модуль ""лЛогСпособЛогированияОповещениеПользователя""","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"НаКлиентеДоступенСпособЛогирования(Парам01)","НаКлиентеДоступенСпособЛогирования","И на клиенте доступен способ логирования ""ОповещениеПользователя""","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"НаСервереДоступенСпособЛогирования(Парам01)","НаСервереДоступенСпособЛогирования","И на сервере доступен способ логирования ""ОповещениеПользователя""","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ДобавляюВЛогСИменемСпособЛогированияОповещениеПользователяСПрефиксом(Парам01,Парам02)","ДобавляюВЛогСИменемСпособЛогированияОповещениеПользователяСПрефиксом","И добавляю в лог с именем """" способ логирования ОповещениеПользователя с префиксом ""Зайка моя""","","");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Функция выполняется перед началом каждого сценария
Функция ПередНачаломСценария() Экспорт
	
КонецФункции

&НаКлиенте
// Функция выполняется перед окончанием каждого сценария
Функция ПередОкончаниемСценария() Экспорт
	
КонецФункции



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Когда в конфигурации есть общий модуль "лЛогСпособЛогированияОповещениеПользователя"
//@ВКонфигурацииЕстьОбщийМодуль(Парам01)
Функция ВКонфигурацииЕстьОбщийМодуль(ИмяОбщегоМодуля) Экспорт
	Ванесса.Проверить(ЕстьОбщийМодулль(ИмяОбщегоМодуля));
КонецФункции

&НаКлиенте
//И на клиенте доступен способ логирования "ОповещениеПользователя"
//@НаКлиентеДоступенСпособЛогирования(Парам01)
Функция НаКлиентеДоступенСпособЛогирования(ИмяСпособа) Экспорт
	Ванесса.Проверить(ЕстьСпособЛОгирования(ИмяСпособа));
КонецФункции

&НаКлиенте
//И на сервере доступен способ логирования "ОповещениеПользователя"
//@НаСервереДоступенСпособЛогирования(Парам01)
Функция НаСервереДоступенСпособЛогирования(ИмяСпособа) Экспорт
	Ванесса.Проверить(ЕстьСпособЛОгированияНаСервере(ИмяСпособа));
КонецФункции

&НаКлиенте
//И добавляю в лог с именем "" способ логирования ОповещениеПользователя с префиксом "Зайка моя"
//@ДобавляюВЛогСИменемСпособЛогированияОповещениеПользователяСПрефиксом(Парам01,Парам02)
Функция ДобавляюВЛогСИменемСпособЛогированияОповещениеПользователяСПрефиксом(ИмяЛога,Префикс) Экспорт
	ПараметрыСпособа = лЛог.ПараметрыСпособаЛогирования("ОповещениеПользователя");
	ПараметрыСпособа.Префикс = Префикс;
	
	лЛог.ДобавитьСпособЛогирования("ОповещениеПользователя", ПараметрыСпособа);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЕстьСпособЛОгирования(ИмяСпособа)
	Способы = лЛогСлужебный.СпособыЛогирования();
	Возврат Способы.Свойство(ИмяСпособа);
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьСпособЛОгированияНаСервере(ИмяСпособа)
	Возврат ЕстьСпособЛОгирования(ИмяСпособа);
КонецФункции

&НаСервере
Функция ЕстьОбщийМодулль(Имя)
	Возврат Метаданные.ОбщиеМодули.Найти(Имя)<>Неопределено;
КонецФункции
