&НаКлиенте
Процедура СпособыЛогированияШаблонСообщенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ТекШаблон = Элементы.СпособыЛогирования.ТекущиеДанные.ШаблонСообщения;
	ПараметрыФормы = Новый Структура("ТекШаблон", ТекШаблон);
	ОткрытьФорму("Справочник.лНастройкиЛогирования.Форма.КонструкторШаблонаИмениСобытия", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура СпособыЛогированияШаблонСообщенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ТекДанные = Элементы.СпособыЛогирования.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ТекДанные.ШаблонСообщения = ВыбранноеЗначение;
	КонецЕсли;

КонецПроцедуры

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьКаталогаЛоговНаСервереНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ДиалогВыбораПапки = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если Не ПустаяСтрока(Объект.ПутьКаталогаЛоговНаСервере) Тогда
		ДиалогВыбораПапки.Каталог = Объект.ПутьКаталогаЛоговНаСервере;
	КонецЕсли;
	ДиалогВыбораПапки.Показать(Новый ОписаниеОповещения("ПутьКаталогаЛоговНаСервереЗавершениеВыбора", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура ПутьКаталогаЛоговНаСервереЗавершениеВыбора(Папка, ДополнительныеПараметры) Экспорт

	Если Папка <> Неопределено И Папка.Количество() > 0 Тогда
		Объект.ПутьКаталогаЛоговНаСервере = Папка[0];
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПутьКаталогаЛоговНаКлиентеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ДиалогВыбораПапки = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если Не ПустаяСтрока(Объект.ПутьКаталогаЛоговНаКлиенте) Тогда
		ДиалогВыбораПапки.Каталог = Объект.ПутьКаталогаЛоговНаКлиенте;
	КонецЕсли;
	ДиалогВыбораПапки.Показать(Новый ОписаниеОповещения("ПутьКаталогаЛоговНаКлиентеЗавершениеВыбора", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура ПутьКаталогаЛоговНаКлиентеЗавершениеВыбора(Папка, ДополнительныеПараметры) Экспорт

	Если Папка <> Неопределено И Папка.Количество() > 0 Тогда
		Объект.ПутьКаталогаЛоговНаКлиенте = Папка[0];
	КонецЕсли;

КонецПроцедуры

#КонецОбласти