#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииСпособовЛогирования(Способы) Экспорт
//	МойСпособ = лЛогСлужебный.НовыйСпособЛогирования("Мой");
//	
//	Способы.Вставить(МойСпособ.Имя, МойСпособ);
КонецПроцедуры

Процедура ПриОпределенииПараметровСпособаЛогирования(ИмяСпособа, ПараметрыСпособа) Экспорт
//	Если ИмяСпособа = "Мой" Тогда
//		ПараметрыСпособа = Новый Структура;
//		ПараметрыСпособа.Вставить("Суффикс", "");
//	КонецЕсли;
КонецПроцедуры

Процедура ПриВыводеСообщенияВЛогПоСпособу(Сообщение, Лог, УровеньЛогирования, ИмяСпособа, Параметры) Экспорт
//	Если ИмяСпособа = "Мой" Тогда
//		Сообщить(Сообщение+Параметры.Суффикс);
//	КонецЕсли;
КонецПроцедуры

Процедура ПриОпределенииПрефиксаОбщихМодулейОпределяющихСпособыЛогирования(Префикс) Экспорт
	
КонецПроцедуры

#КонецОбласти
