#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииСпособовЛогирования(Способы) Экспорт
//	НовыйСпособ = лЛогСлужебный.НовыйСпособЛогирования("МойНовый");
//	Способы.Вставить("МойНовый", НовыйСпособ);
КонецПроцедуры

Процедура ПриОпределенииПараметровСпособаЛогирования(ИмяСпособа, ПараметрыСпособа) Экспорт
//	ПараметрыСпособа = Новый Структура;
//	ПараметрыСпособа.Вставить("Префикс","Как хорош");
	
КонецПроцедуры

Процедура ПриВыводеСообщенияВЛогПоСпособу(Сообщение, Лог, УровеньЛогирования, ИмяСпособа, Параметры) Экспорт
//	Если ИмяСпособа = "МойНовый" Тогда
//		#Если Клиент Тогда
//		ПоказатьОповещениеПользователя(Параметры.Префикс +"/" +Сообщение);
//		#КонецЕсли
//	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// предназначен для модулей, которые являются частью некоторой функциональной подсистемы. В нем должны быть размещены экспортные процедуры и функции, которые допустимо вызывать только из других функциональных подсистем этой же библиотеки.
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// содержит процедуры и функции, составляющие внутреннюю реализацию общего модуля. В тех случаях, когда общий модуль является частью некоторой функциональной подсистемы, включающей в себя несколько объектов метаданных, в этом разделе также могут быть размещены служебные экспортные процедуры и функции, предназначенные только для вызова из других объектов данной подсистемы.
#КонецОбласти
